EDT/УТ/src/Reports/ОтчетПоВыполненнымЗаказам/ОтчетПоВыполненнымЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоВыполненнымЗаказам</name>
</mdclass:Report>

EDT/УТ/src/Documents/Фрахт/Фрахт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Фрахт</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>101</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УслугиСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнтернетМагазина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВнешнегоЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнтернетМагазинаСпр</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытиеЗаказов</name>
    <comment>Реквизит для хранения истории по ЗакрытиямЗаказа</comment>
    <type>
      <types>DocumentRef.ЗакрытиеЗаказов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Catalogs/КатегорииДоставки2014/КатегорииДоставки2014.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииДоставки2014</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КГТ</name>
      <description>КГТ</description>
    </items>
    <items>
      <name>МГТ</name>
      <description>МГТ</description>
    </items>
    <items>
      <name>СГТ</name>
      <description>СГТ</description>
    </items>
  </predefined>
  <attributes>
    <name>Категория</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМинутНаРазгрузку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыТранспорта</name>
    <attributes>
      <name>ТипТранспорта</name>
      <type>
        <types>CatalogRef.ТипыТранспортаДляЛогистики</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеДоступен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПродолжительностьРазгрузкиПоКомитентам</name>
    <attributes>
      <name>Комитент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьРазгрузки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Брейки</name>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесогабаритнаяХарактеристика</name>
      <type>
        <types>EnumRef.ГабаритныеХарактеристикиЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/РасчетныеБрейки/РасчетныеБрейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РасчетныеБрейки</name>
  <owners>Catalog.ТипыТарифов</owners>
  <owners>Catalog.ТарифныеСетки</owners>
  <attributes>
    <name>КодБрейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаРезультатМестнойДоставки/новаРезультатМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаРезультатМестнойДоставки</name>
  <predefined>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>ВыполненаЧастично</name>
      <description>Выполнена частично</description>
    </items>
    <items>
      <name>НеВыполнена</name>
      <description>Не выполнена</description>
    </items>
  </predefined>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.новаРезультатВыполненияМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныНеВыполнения</name>
    <type>
      <types>CatalogRef.новаПричиныНеВыполненияМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплатыВодителю</name>
    <comment>Если выполнена 100%</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПосещена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Reports/ОтчетПоВыполненнымЗаказам/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СоответствиеЗакрепления = Новый Структура;
	СоответствиеЗакрепления.Вставить("ПоКатегориямЗаказа", 10);
	СоответствиеЗакрепления.Вставить("ПоВесуЗаказа", 10);
	СоответствиеЗакрепления.Вставить("ПоГеографииЗаказа", 11);
	СоответствиеЗакрепления.Вставить("ПоОплатамКлиентов", 10);

	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрРазворачиватьПустыеЗначения = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РазворачиватьПустыеЗначения"));
	РазворачиватьПустыеЗначения = ПараметрРазворачиватьПустыеЗначения.Значение;
	
	ПараметрПоОсновномуМагазину  = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПоОсновномуМагазину"));
	ПоОсновномуМагазину = ПараметрПоОсновномуМагазину.Значение;
	
	ПараметрВариантОтчета = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТекущийВариант"));
    ТекущийВариант = СокрЛП(ПараметрВариантОтчета.Значение);
	
	ПараметрПериодОтчета	= НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
	ДатаНачала = ПараметрПериодОтчета.Значение.ДатаНачала;
	ДатаОкончания = ПараметрПериодОтчета.Значение.ДатаОкончания;	
	
    ПараметрИнтернетМагазин = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИнтернетМагазин"));
    ИнтернетМагазин = ?(ПараметрИнтернетМагазин.Использование, ПараметрИнтернетМагазин.Значение, Неопределено);
	
	ПараметрВыводитьДокументы = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьДокументы"));
    ВыводитьДокументы = ПараметрВыводитьДокументы.Значение;
	
	Если ВыводитьДокументы И ПараметрИнтернетМагазин.Использование Тогда
		Попытка
			НастройкиОтчета.Структура[0].Строки[0].Структура[0].Структура[0].Использование = Истина;
		Исключение
		Конецпопытки;
		
	ИначеЕсли ВыводитьДокументы И НЕ ПараметрИнтернетМагазин.Использование Тогда
		Попытка
			НастройкиОтчета.Структура[0].Строки[0].Структура[0].Структура[0].Использование = Ложь;
		Исключение
		Конецпопытки;

		Сообщить("Нельзя включать вывод документов по всем партнерам!");
	КонецЕсли;
	
	//ПараметрАльтернативныйВариант = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("АльтернативныйВариант"));
	//АльтернативныйВариант = ПараметрАльтернативныйВариант.Значение;

	ИсточникДанныхОтчета = ДанныеДляОтчета(ДатаНачала, ДатаОкончания, ИнтернетМагазин, ТекущийВариант, РазворачиватьПустыеЗначения, ПоОсновномуМагазину);
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);	
	
	ВнешнийНаборДанных = Новый Структура("ИсточникДанных", ИсточникДанныхОтчета); 
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки); 
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
	ДокументРезультат.ПоказатьУровеньГруппировокКолонок(0);
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0); 

	ДокументРезультат.ФиксацияСверху =  СоответствиеЗакрепления[ТекущийВариант];
	
КонецПроцедуры

Функция ДанныеДляОтчета(ДатаНачала, ДатаОкончания, ИнтернетМагазин, ТекущийВариант, РазворачиватьПустыеЗначения, ПоОсновномуМагазину)
	
	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		Сообщить("Начало запроса данных по заказам: " + СокрЛП(ТекущаяДата()));
	КонецЕсли;	
	
	ПараметрыЗапроса = Отчеты.ОтчетАгентаУниверсальный.ПараметрыЗапросаПоЗаказам();
	Если ПоОсновномуМагазину И Не ИнтернетМагазин = Неопределено Тогда
		ПараметрыЗапроса.Партнер = ИнтернетМагазин;
		ПараметрыЗапроса.ПоПартнеру = Истина;
	ИначеЕсли НЕ ПоОсновномуМагазину И Не ИнтернетМагазин = Неопределено Тогда
		ПараметрыЗапроса.ИнтернетМагазин = ИнтернетМагазин;
		ПараметрыЗапроса.ПоИнтернетМагазину = Истина;
	КонецЕсли;
		
	ТаблицаЗаказов = Отчеты.ОтчетАгентаУниверсальный.ПолучитьЗакрытыеЗаказыВПериоде(Новый СтандартныйПериод(ДатаНачала, ДатаОкончания), ПараметрыЗапроса);

	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		Сообщить("Начало запроса данных по отчету: " + СокрЛП(ТекущаяДата()));
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЗаказов.Документ КАК Документ,
		|	ТаблицаЗаказов.НомерДокумента КАК НомерДокумента,
		|	ТаблицаЗаказов.ДатаДокумента КАК ДатаДокумента,
		|	ТаблицаЗаказов.ЮрЛицо КАК ЮрЛицо,
		|	ТаблицаЗаказов.ТипЗаказа КАК ТипЗаказа,
		|	ТаблицаЗаказов.Транспорт КАК Транспорт,
		|	ВЫРАЗИТЬ(ТаблицаЗаказов.ИнтернетМагазин КАК Справочник.Контрагенты) КАК ИнтернетМагазин,
		|	ВЫРАЗИТЬ(ТаблицаЗаказов.Партнер КАК Справочник.Контрагенты) КАК Партнер,
		|	ВЫРАЗИТЬ(ТаблицаЗаказов.КатегорияДоставки КАК Справочник.КатегорииДоставки2014) КАК КатегорияДоставки,
		|	ТаблицаЗаказов.Водитель КАК Водитель,
		|	ТаблицаЗаказов.Клиент КАК Клиент,
		|	ТаблицаЗаказов.ТипОплаты КАК ТипОплаты,
		|	ТаблицаЗаказов.СтатусЗаказа КАК СтатусЗаказа,
		|	ТаблицаЗаказов.ПричинаНевыполнения КАК ПричинаНевыполнения,
		|	ТаблицаЗаказов.СтатусИнтернетМагазина КАК СтатусИнтернетМагазина,
		|	ТаблицаЗаказов.ПричинаОтказа КАК ПричинаОтказа,
		|	ТаблицаЗаказов.VIPДоставка КАК VIPДоставка,
		|	ТаблицаЗаказов.ВидVip КАК ВидVip,
		|	ТаблицаЗаказов.ТарифнаяСетка КАК ТарифнаяСетка,
		|	ТаблицаЗаказов.РасчетныйБрейк КАК РасчетныйБрейк,
		|	ТаблицаЗаказов.ТарифнаяСеткаПартнера КАК ТарифнаяСеткаПартнера,
		|	ТаблицаЗаказов.ЗонаТарификации КАК ЗонаТарификации,
		|	ТаблицаЗаказов.ПричинаОтклоненияЗаказа КАК ПричинаОтклоненияЗаказа,
		|	ТаблицаЗаказов.ТерминалДоставки КАК ТерминалДоставки,
		|	ТаблицаЗаказов.ТерминалПриёма КАК ТерминалПриёма,
		|	ТаблицаЗаказов.ОбъемныйБрейк КАК ОбъемныйБрейк,
		|	ТаблицаЗаказов.ПодъемныйБрейк КАК ПодъемныйБрейк,
		|	ТаблицаЗаказов.СуммаОценочная КАК СуммаОценочная,
		|	ТаблицаЗаказов.СуммаПолученная КАК СуммаПолученная,
		|	ТаблицаЗаказов.СуммаДоставкиДоМКАД КАК СуммаДоставкиДоМКАД,
		|	ТаблицаЗаказов.СуммаДоставкиЗаМКАД КАК СуммаДоставкиЗаМКАД,
		|	ТаблицаЗаказов.УслугиСД КАК УслугиСД,
		|	ТаблицаЗаказов.БанковскаяКомиссия КАК БанковскаяКомиссия,
		|	ТаблицаЗаказов.КассовоеОбслуживание КАК КассовоеОбслуживание,
		|	ТаблицаЗаказов.СуммаВозврата КАК СуммаВозврата,
		|	ТаблицаЗаказов.Масса КАК Масса,
		|	ТаблицаЗаказов.СуммаЧастичногоВозврата КАК СуммаЧастичногоВозврата,
		|	ТаблицаЗаказов.ОплаченоКлиентовНал КАК ОплаченоКлиентовНал,
		|	ТаблицаЗаказов.АгентскоеВознаграждение КАК АгентскоеВознаграждение,
		|	ТаблицаЗаказов.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
		|	ТаблицаЗаказов.УслугиСДЧистые КАК УслугиСДЧистые,
		|	ТаблицаЗаказов.СтраховойСбор КАК СтраховойСбор,
		|	ТаблицаЗаказов.ФактическийВес КАК ФактическийВес,
		|	ТаблицаЗаказов.ОбъемЗабора КАК ОбъемЗабора,
		|	ТаблицаЗаказов.ОбъемЗабораПоЗаказам КАК ОбъемЗабораПоЗаказам,
		|	ТаблицаЗаказов.ВыгруженныйОбъем КАК ВыгруженныйОбъем,
		|	ТаблицаЗаказов.ТарифицируемыйВес КАК ТарифицируемыйВес,
		|	ТаблицаЗаказов.СтоимостьОценочнаяПоТоварно КАК СтоимостьОценочнаяПоТоварно,
		|	ТаблицаЗаказов.КоличествоПереносовСЗаездами КАК КоличествоПереносовСЗаездами,
		|	ТаблицаЗаказов.СтоимостьПереносовСЗаездами КАК СтоимостьПереносовСЗаездами,
		|	ТаблицаЗаказов.СтоимостьПодъемаМП КАК СтоимостьПодъемаМП
		|ПОМЕСТИТЬ ТаблицаЗаказов
		|ИЗ
		|	&ТаблицаЗаказов КАК ТаблицаЗаказов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетныеБрейки.Наименование КАК Наименование,
		|	РасчетныеБрейки.ВесОт КАК ВесОт,
		|	РасчетныеБрейки.ВесДо КАК ВесДо
		|ПОМЕСТИТЬ ВТ_РасчетныеБрейки
		|ИЗ
		|	Справочник.РасчетныеБрейки КАК РасчетныеБрейки
		|ГДЕ
		|	РасчетныеБрейки.Владелец.Код = ""strizh""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЗаказов.Документ КАК Документ,
		|	1 КАК ЗаказыЗаборы,
		|	НАЧАЛОПЕРИОДА(ТаблицаЗаказов.ДатаДокумента, МЕСЯЦ) КАК Месяц,
		|	ТаблицаЗаказов.НомерДокумента КАК НомерДокумента,
		|	ТаблицаЗаказов.ЮрЛицо КАК ЮрЛицо,
		|	ТаблицаЗаказов.ТипЗаказа КАК ТипЗаказа,
		|	ТаблицаЗаказов.Транспорт КАК Транспорт,
		|	ВЫБОР
		|		КОГДА &ПоОсновномуМагазину
		|			ТОГДА ТаблицаЗаказов.Партнер
		|		ИНАЧЕ ТаблицаЗаказов.ИнтернетМагазин
		|	КОНЕЦ КАК ИнтернетМагазин,
		|	ТаблицаЗаказов.Партнер КАК Партнер,
		|	ТаблицаЗаказов.КатегорияДоставки КАК КатегорияДоставки1,
		|	ТаблицаЗаказов.Водитель КАК Водитель,
		|	ТаблицаЗаказов.Клиент КАК Клиент,
		|	ТаблицаЗаказов.ТипОплаты КАК ТипОплаты,
		|	ТаблицаЗаказов.СтатусЗаказа КАК СтатусЗаказа,
		|	ТаблицаЗаказов.ПричинаНевыполнения КАК ПричинаНевыполнения,
		|	ТаблицаЗаказов.СтатусИнтернетМагазина КАК СтатусИнтернетМагазина,
		|	ТаблицаЗаказов.ПричинаОтказа КАК ПричинаОтказа,
		|	ТаблицаЗаказов.VIPДоставка КАК VIPДоставка,
		|	ТаблицаЗаказов.ВидVip КАК ВидVip,
		|	ТаблицаЗаказов.ТарифнаяСетка КАК ТарифнаяСетка,
		|	ТаблицаЗаказов.РасчетныйБрейк КАК РасчетныйБрейк,
		|	ТаблицаЗаказов.ТарифнаяСеткаПартнера КАК ТарифнаяСеткаПартнера,
		|	ТаблицаЗаказов.ЗонаТарификации КАК ЗонаТарификации,
		|	ТаблицаЗаказов.ПричинаОтклоненияЗаказа КАК ПричинаОтклоненияЗаказа,
		|	ТаблицаЗаказов.ТерминалДоставки КАК ТерминалДоставки,
		|	ТаблицаЗаказов.ТерминалПриёма КАК ТерминалПриёма,
		|	ТаблицаЗаказов.ОбъемныйБрейк КАК ОбъемныйБрейк,
		|	ТаблицаЗаказов.ПодъемныйБрейк КАК ПодъемныйБрейк,
		|	ТаблицаЗаказов.СуммаОценочная КАК СуммаОценочная,
		|	ТаблицаЗаказов.СуммаПолученная КАК СуммаПолученная,
		|	ТаблицаЗаказов.СуммаДоставкиДоМКАД КАК СуммаДоставкиДоМКАД,
		|	ТаблицаЗаказов.СуммаДоставкиЗаМКАД КАК СуммаДоставкиЗаМКАД,
		|	ТаблицаЗаказов.УслугиСД КАК УслугиСД,
		|	ТаблицаЗаказов.БанковскаяКомиссия КАК БанковскаяКомиссия,
		|	ТаблицаЗаказов.КассовоеОбслуживание КАК КассовоеОбслуживание,
		|	ТаблицаЗаказов.СуммаВозврата КАК СуммаВозврата,
		|	ТаблицаЗаказов.Масса КАК Масса,
		|	ТаблицаЗаказов.СуммаЧастичногоВозврата КАК СуммаЧастичногоВозврата,
		|	ТаблицаЗаказов.ОплаченоКлиентовНал КАК ОплаченоКлиентовНал,
		|	ТаблицаЗаказов.АгентскоеВознаграждение КАК АгентскоеВознаграждение,
		|	ТаблицаЗаказов.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
		|	ТаблицаЗаказов.УслугиСДЧистые КАК УслугиСДЧистые,
		|	ТаблицаЗаказов.СтраховойСбор КАК СтраховойСбор,
		|	ТаблицаЗаказов.ФактическийВес КАК ФактическийВес,
		|	ТаблицаЗаказов.ОбъемЗабора КАК ОбъемЗабора,
		|	ТаблицаЗаказов.ОбъемЗабораПоЗаказам КАК ОбъемЗабораПоЗаказам,
		|	ТаблицаЗаказов.ВыгруженныйОбъем КАК ВыгруженныйОбъем,
		|	ТаблицаЗаказов.ТарифицируемыйВес КАК ТарифицируемыйВес,
		|	ТаблицаЗаказов.СтоимостьОценочнаяПоТоварно КАК СтоимостьОценочнаяПоТоварно,
		|	ТаблицаЗаказов.КоличествоПереносовСЗаездами КАК КоличествоПереносовСЗаездами,
		|	ТаблицаЗаказов.СтоимостьПереносовСЗаездами КАК СтоимостьПереносовСЗаездами,
		|	ТаблицаЗаказов.СтоимостьПодъемаМП КАК СтоимостьПодъемаМП,
		|	0 КАК Оплачено,
		|	""Наличные+Пластик"" КАК ТипОплатыОтчет,
		|	ЕСТЬNULL(ВТ_РасчетныеБрейки.Наименование, "" Вес не определен"") КАК ОбщийВесЗаказа,
		|	ВЫБОР
		|		КОГДА ТаблицаЗаказов.ЗонаТарификации В (&СписокЗон2)
		|			ТОГДА ""2 зона""
		|		КОГДА ТаблицаЗаказов.ЗонаТарификации В (&СписокЗон3)
		|			ТОГДА ""3 зона""
		|		ИНАЧЕ ""1 зона""
		|	КОНЕЦ КАК Зона,
		|	ВЫБОР
		|		КОГДА ТаблицаЗаказов.КатегорияДоставки = ЗНАЧЕНИЕ(Справочник.КатегорииДоставки2014.ПустаяСсылка)
		|			ТОГДА ""Нет категории""
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ТаблицаЗаказов.КатегорияДоставки)
		|	КОНЕЦ КАК КатегорияДоставки,
		|	ВЫБОР
		|		КОГДА ТаблицаЗаказов.КатегорияДоставки = ЗНАЧЕНИЕ(Справочник.КатегорииДоставки2014.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ТаблицаЗаказов.КатегорияДоставки ССЫЛКА Справочник.КатегорииДоставки2014
		|					ТОГДА ТаблицаЗаказов.КатегорияДоставки.Категория
		|				ИНАЧЕ 99
		|			КОНЕЦ
		|	КОНЕЦ КАК СортировкаКатегории
		|ИЗ
		|	ТаблицаЗаказов КАК ТаблицаЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетныеБрейки КАК ВТ_РасчетныеБрейки
		|		ПО (ТаблицаЗаказов.ТарифицируемыйВес > ВТ_РасчетныеБрейки.ВесОт
		|				И ТаблицаЗаказов.ТарифицируемыйВес <= ВТ_РасчетныеБрейки.ВесДо)
		|ГДЕ
		|	(ТаблицаЗаказов.СтатусЗаказа В (&СтатусЗаказа)
		|			ИЛИ ТаблицаЗаказов.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
		|			ИЛИ ТаблицаЗаказов.Документ ССЫЛКА Документ.Фрахт)";
	
	#КонецОбласти
	
	//СписокЗон2 = Новый Массив;
	//СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000004"));//"За МКАД"
	//СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000001"));//"за МКАД < 30 км."
	//СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000036"));//"за МКАД < 30 км."
	//СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000040"));//"за МКАД < 30 км."
	//СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000007"));//"за КАД < 30 км."
	//СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000053"));//"КАД +30 КМ"
	//
	//СписокЗон3 = Новый Массив;
	//СписокЗон3.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000054"));//"ЛО"
	//СписокЗон3.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000029"));//"за МКАД > 30 км."
	//СписокЗон3.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000037"));//"за МКАД > 30 км."
	//СписокЗон3.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000041"));//"за МКАД > 30 км."

	//CeHbKA 29.01.2021
	СписокЗон2 = Новый Массив;
	СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000004").КлассификаторЗоныТарификации);//"За МКАД"
	СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000001").КлассификаторЗоныТарификации);//"за МКАД < 30 км."
	СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000036").КлассификаторЗоныТарификации);//"за МКАД < 30 км."
	СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000040").КлассификаторЗоныТарификации);//"за МКАД < 30 км."
	СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000007").КлассификаторЗоныТарификации);//"за КАД < 30 км."
	СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000053").КлассификаторЗоныТарификации);//"КАД +30 КМ"
	//Асеев 19.04.2024 (по письму Отчет по географии доставки заказов)>>>
	СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000064").КлассификаторЗоныТарификации);//"МКАД+10 2023"
	СписокЗон2.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000065").КлассификаторЗоныТарификации);//"МКАД+10 - ЦКАД 2023"
	//Асеев 19.04.2024 (по письму Отчет по географии доставки заказов)<<<
	
	СписокЗон3 = Новый Массив;
	СписокЗон3.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000054").КлассификаторЗоныТарификации);//"ЛО"
	СписокЗон3.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000029").КлассификаторЗоныТарификации);//"за МКАД > 30 км."
	СписокЗон3.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000037").КлассификаторЗоныТарификации);//"за МКАД > 30 км."
	СписокЗон3.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000041").КлассификаторЗоныТарификации);//"за МКАД > 30 км."
	//Асеев 19.04.2024 (по письму Отчет по географии доставки заказов)>>>
	СписокЗон3.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000066").КлассификаторЗоныТарификации);//"ЦКАД-А108 2023"
	СписокЗон3.Добавить(Справочники.ГруппыРайонов.НайтиПоКоду("00000000067").КлассификаторЗоныТарификации);//"А108-Граница МО 2023"
	//Асеев 19.04.2024 (по письму Отчет по географии доставки заказов)<<<
	//CeHbKA 29.01.2021
	
	СтатусЗаказа = Новый Массив;
	СтатусЗаказа.Добавить(Справочники.новаРезультатМестнойДоставки.Выполнена);
	СтатусЗаказа.Добавить(Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично);
	
	Запрос.УстановитьПараметр("ТаблицаЗаказов", ТаблицаЗаказов);
	Запрос.УстановитьПараметр("СписокЗон2", СписокЗон2);
	Запрос.УстановитьПараметр("СписокЗон3", СписокЗон3);
	Запрос.УстановитьПараметр("СтатусЗаказа", СтатусЗаказа);
	Запрос.УстановитьПараметр("ПоОсновномуМагазину", ПоОсновномуМагазину);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	
	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		Сообщить("Начало обработки данных по отчету: " + СокрЛП(ТекущаяДата()));
	КонецЕсли;
	
	ТаблицаОплат = Неопределено;
	Если ТекущийВариант = "ПоОплатамКлиентов" Тогда
		ТаблицаОплат = Отчеты.ОтчетАгентаУниверсальный.ПолучитьДанныеПоОплатам(ДатаНачала, ДатаОкончания, ИнтернетМагазин);
		
		РезультатЗапроса = Отчеты.ОтчетАгентаУниверсальный.ОбъединитьДанныеВывода(РезультатЗапроса, ТаблицаОплат);
	КонецЕсли;	
	
	Если Не ТекущийВариант = "ПоОплатамКлиентов" И РазворачиватьПустыеЗначения Тогда
		
		СписокКлиентов = РезультатЗапроса.Скопировать();
		СписокТипов = РезультатЗапроса.Скопировать();
		СписокМесяцев = РезультатЗапроса.Скопировать();
		
		СписокКлиентов.Свернуть("ИнтернетМагазин");
		СписокТипов.Свернуть("ТипЗаказа");
		СписокМесяцев.Свернуть("Месяц");
		
		Если ТекущийВариант = "ПоВесуЗаказа" Тогда
			
			СписокГруппВесов = РезультатЗапроса.Скопировать();
			СписокГруппВесов.Свернуть("ОбщийВесЗаказа");
			
			Для Каждого СтрокаКлиент Из СписокКлиентов Цикл
				Для Каждого СтрокаГруппа Из СписокГруппВесов Цикл
					Для Каждого СтрокаТип ИЗ СписокТипов Цикл
						Для Каждого СтрокаМесяц ИЗ СписокМесяцев Цикл
							СтрокаЭмуляции = РезультатЗапроса.Добавить();
							СтрокаЭмуляции.ЗаказыЗаборы = 0;
							
							ЗаполнитьЗначенияСвойств(СтрокаЭмуляции, СтрокаКлиент);
							ЗаполнитьЗначенияСвойств(СтрокаЭмуляции, СтрокаТип);
							ЗаполнитьЗначенияСвойств(СтрокаЭмуляции, СтрокаГруппа);
							ЗаполнитьЗначенияСвойств(СтрокаЭмуляции, СтрокаМесяц);
						КонецЦикла;
						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
		ИначеЕсли ТекущийВариант = "ПоКатегориямЗаказа" Тогда
			
			СписокКатегорий = РезультатЗапроса.Скопировать();
			СписокКатегорий.Свернуть("КатегорияДоставки, СортировкаКатегории");
			
			Для Каждого СтрокаКлиент Из СписокКлиентов Цикл
				Для Каждого СтрокаКатегория Из СписокКатегорий Цикл
					Для Каждого СтрокаТип ИЗ СписокТипов Цикл
						Для Каждого СтрокаМесяц ИЗ СписокМесяцев Цикл
							
							СтрокаЭмуляции = РезультатЗапроса.Добавить();
							СтрокаЭмуляции.ЗаказыЗаборы = 0;
							
							ЗаполнитьЗначенияСвойств(СтрокаЭмуляции, СтрокаКлиент);
							ЗаполнитьЗначенияСвойств(СтрокаЭмуляции, СтрокаТип);
							ЗаполнитьЗначенияСвойств(СтрокаЭмуляции, СтрокаКатегория);
							ЗаполнитьЗначенияСвойств(СтрокаЭмуляции, СтрокаМесяц);
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
					
		ИначеЕсли ТекущийВариант = "ПоГеографииЗаказа" Тогда
			СписокТерминалов  = РезультатЗапроса.Скопировать();
			СписокЗон  = РезультатЗапроса.Скопировать();
			
			СписокТерминалов.Свернуть("ТерминалДоставки");
			СписокЗон.Свернуть("Зона");	
			
			Для Каждого СтрокаКлиент Из СписокКлиентов Цикл
				Для Каждого СтрокаТерминал Из СписокТерминалов Цикл
					для Каждого СтрокаЗона Из СписокЗон Цикл
						Для Каждого СтрокаТип ИЗ СписокТипов Цикл
							Для Каждого СтрокаМесяц ИЗ СписокМесяцев Цикл
								
								СтрокаЭмуляции = РезультатЗапроса.Добавить();
								СтрокаЭмуляции.ЗаказыЗаборы = 0;
								
								ЗаполнитьЗначенияСвойств(СтрокаЭмуляции, СтрокаКлиент);
								ЗаполнитьЗначенияСвойств(СтрокаЭмуляции, СтрокаТерминал);
								ЗаполнитьЗначенияСвойств(СтрокаЭмуляции, СтрокаЗона);
								ЗаполнитьЗначенияСвойств(СтрокаЭмуляции, СтрокаТип);
								ЗаполнитьЗначенияСвойств(СтрокаЭмуляции, СтрокаМесяц);
							КонецЦикла;
						КонецЦикла;	
					КонецЦикла;	
				КонецЦикла;	
			КонецЦикла;
			
		КонецЕсли;	
		
	КонецЕсли;
		
	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		Сообщить("Конец обработки данных по отчету: " + СокрЛП(ТекущаяДата()));
	КонецЕсли;
	
	Возврат РезультатЗапроса;
	
КонецФункции
